Repository: kylezhao/isekai-log
Catalog: Isekai Log/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans

source: %@'s Log
ja: %@の記録
zh_hans: %@的日志

source: %@'s Party
ja: %@のパーティー
zh_hans: %@的队伍

# %lld→%lld tok
source: %1$lld→%2$lld tok
ja: %lld→%lld トークン
zh_hans: %lld→%lld 词元

source: A party cannot transfer money to itself.
ja: パーティーは自分自身にお金を送金できません。
zh_hans: 队伍不能向自己转账。

source: About
ja: 情報
zh_hans: 关于

source: Add Item
ja: 項目を追加
zh_hans: 添加项目

source: Add an Anthropic API key in Settings before playing online.
ja: オンラインでプレイする前に「設定」で Anthropic API キーを追加してください。
zh_hans: 在线游玩前请先在“设置”中添加 Anthropic API 密钥。

source: Add to party
ja: パーティーに加える
zh_hans: 加入队伍

source: Adventure title (optional)
ja: 冒険のタイトル（任意）
zh_hans: 冒险标题（可选）

source: Amount
ja: 金額
zh_hans: 金额

source: Amount must be positive.
ja: 金額は正の数である必要があります。
zh_hans: 金额必须为正数。

source: Anthropic API key
ja: Anthropic API キー
zh_hans: Anthropic API 密钥

source: Apple Intelligence · works offline
ja: Apple Intelligence · オフラインで動作
zh_hans: Apple 智能 · 可离线使用

source: Begin
ja: はじめる
zh_hans: 开始

source: Begin a new life
ja: 新しい人生をはじめる
zh_hans: 开启新的人生

source: Cancel
ja: キャンセル
zh_hans: 取消

source: Cancelled.
ja: キャンセルしました。
zh_hans: 已取消。

# Changed %@ into %@
source: Changed %1$@ into %2$@
ja: %@ を %@ に両替
zh_hans: 将 %@ 兑换为 %@

source: Class
ja: 職業
zh_hans: 职业

source: Claude is overloaded right now. Try again in a moment.
ja: Claude は現在混み合っています。しばらくしてからお試しください。
zh_hans: Claude 当前负载过高。请稍后再试。

source: Claude · needs network and an API key
ja: Claude · ネットワークと API キーが必要
zh_hans: Claude · 需要网络和 API 密钥

source: Cloud
ja: クラウド
zh_hans: 云端

source: Cloud mode needs an Anthropic API key. Add one in Settings.
ja: クラウドモードには Anthropic API キーが必要です。「設定」で追加してください。
zh_hans: 云端模式需要 Anthropic API 密钥。请在“设置”中添加。

source: Cloud model
ja: クラウドモデル
zh_hans: 云端模型

source: Context window: %lld tokens. Prompts are trimmed to fit.
ja: コンテキストウィンドウ: %lld トークン。プロンプトは収まるように短縮されます。
zh_hans: 上下文窗口：%lld 词元。提示词会被裁剪以适应。

source: Custom world
ja: カスタム世界
zh_hans: 自定义世界

source: Default for new adventures
ja: 新しい冒険の既定値
zh_hans: 新冒险的默认设置

source: Delete adventure
ja: 冒険を削除
zh_hans: 删除冒险

source: Describe a transaction
ja: 取引を説明してください
zh_hans: 描述一笔交易

source: Describe the narrator's voice, attitude and quirks
ja: 語り手の声色、態度、くせを説明してください
zh_hans: 描述叙述者的语气、态度和怪癖

source: Describe the world and the hero's starting situation
ja: 世界と主人公の初期状況を説明してください
zh_hans: 描述世界和主角的初始处境

source: Describe your own setting.
ja: 自分だけの舞台設定を説明します。
zh_hans: 描述你自己的设定。

source: Done
ja: 完了
zh_hans: 完成

source: Exchange
ja: 両替
zh_hans: 兑换

source: Export log as Markdown
ja: ログを Markdown で書き出す
zh_hans: 导出日志为 Markdown

source: From
ja: 変換元
zh_hans: 从

source: Groups the ledger has traded with. They appear automatically when money changes hands.
ja: 台帳が取引したグループ。お金が動くと自動的に表示されます。
zh_hans: 账本曾与之交易的团体。资金往来时会自动出现。

source: Guild Ledger
ja: ギルド台帳
zh_hans: 公会账本

source: Hero name
ja: 主人公の名前
zh_hans: 主角名字

source: Higher is more surprising. Applies to the on-device model.
ja: 高いほど意外性が増します。デバイス上のモデルに適用されます。
zh_hans: 数值越高越出人意料。适用于设备端模型。

source: History
ja: 履歴
zh_hans: 历史

source: Item at %@
ja: %@ の項目
zh_hans: %@ 的项目

source: Ledger
ja: 台帳
zh_hans: 账本

# Ledger refused %@ for "%@": %@
source: Ledger refused %1$@ for "%2$@": %3$@
ja: 台帳は「%2$@」の %1$@ を拒否しました: %3$@
zh_hans: 账本拒绝了“%2$@”的 %1$@：%3$@

source: Model
ja: モデル
zh_hans: 模型

source: Name
ja: 名前
zh_hans: 名字

source: Narrator
ja: 語り手
zh_hans: 叙述者

source: Narrator personality
ja: 語り手の性格
zh_hans: 叙述者性格

source: Narrator runs
ja: 語り手の実行場所
zh_hans: 叙述者运行于

source: Net worth
ja: 総資産
zh_hans: 净资产

source: New Adventure
ja: 新しい冒険
zh_hans: 新冒险

source: New adventure
ja: 新しい冒険
zh_hans: 新冒险

source: No money found in that sentence.
ja: その文にはお金が見つかりませんでした。
zh_hans: 这句话中没有发现金额。

source: No party members yet
ja: まだパーティーメンバーがいません
zh_hans: 还没有队伍成员

source: No transactions yet. Coins will appear here as the story unfolds.
ja: まだ取引はありません。物語が進むとここに硬貨が現れます。
zh_hans: 还没有交易。随着故事展开，硬币会出现在这里。

# Not enough funds: needs %@, has %@.
source: Not enough funds: needs %1$@, has %2$@.
ja: 資金不足: 必要 %@、所持 %@。
zh_hans: 资金不足：需要 %@，现有 %@。

source: On-device
ja: デバイス上
zh_hans: 设备端

source: On-device model
ja: デバイス上のモデル
zh_hans: 设备端模型

source: Online mode sends the persona, party status and recent story to the Anthropic Messages API with structured output. Opus 5.5 and Sonnet 5.5 run with adaptive thinking at low effort and server-side refusal fallbacks.
ja: オンラインモードでは、ペルソナ、パーティーの状態、直近の物語を構造化出力付きで Anthropic Messages API に送信します。Opus 5.5 と Sonnet 5.5 は低エフォートの適応的思考とサーバー側の拒否フォールバックで動作します。
zh_hans: 在线模式会将角色设定、队伍状态和近期剧情以结构化输出发送至 Anthropic Messages API。Opus 5.5 与 Sonnet 5.5 以低强度自适应思考运行，并启用服务器端拒绝回退。

source: Other parties
ja: その他のパーティー
zh_hans: 其他队伍

source: Party
ja: パーティー
zh_hans: 队伍

source: Ready
ja: 準備完了
zh_hans: 就绪

source: Record in plain words
ja: ふつうの言葉で記録
zh_hans: 用日常语言记录

# Recorded %lld via %@.
source: Recorded %1$lld via %2$@.
ja: %2$@ で %1$lld 件を記録しました。
zh_hans: 通过 %2$@ 记录了 %1$lld 笔。

source: Recruit a companion
ja: 仲間を勧誘
zh_hans: 招募同伴

source: Role
ja: 役割
zh_hans: 角色

source: Rule-based narrator, no model needed
ja: ルールベースの語り手、モデル不要
zh_hans: 基于规则的叙述者，无需模型

source: Scripted demo
ja: スクリプトデモ
zh_hans: 脚本演示

source: Select an item
ja: 項目を選択してください
zh_hans: 请选择一个项目

source: Settings
ja: 設定
zh_hans: 设置

source: Show model metrics under replies
ja: 返答の下にモデル指標を表示
zh_hans: 在回复下方显示模型指标

source: Start an adventure in another world. A narrator will tell your story and a ledger will keep honest books on every coin.
ja: 異世界での冒険をはじめましょう。語り手が物語を紡ぎ、台帳がすべての硬貨を正直に記録します。
zh_hans: 开启异世界冒险。叙述者讲述你的故事，账本如实记录每一枚硬币。

source: Starting purse
ja: 初期資金
zh_hans: 初始钱袋

source: Starting purse: %lld G
ja: 初期資金: %lld G
zh_hans: 初始钱袋：%lld G

source: Stored in the keychain on this device
ja: このデバイスのキーチェーンに保存されています
zh_hans: 已保存在此设备的钥匙串中

source: Switched to %@ mode.
ja: %@モードに切り替えました。
zh_hans: 已切换到%@模式。

source: Temperature: %.2f
ja: 温度: %.2f
zh_hans: 温度：%.2f

source: The API key was rejected. Check it in Settings.
ja: API キーが拒否されました。「設定」で確認してください。
zh_hans: API 密钥被拒绝。请在“设置”中检查。

source: The adventure has no player party.
ja: この冒険にはプレイヤーのパーティーがありません。
zh_hans: 此冒险没有玩家队伍。

source: The model is busy. Wait a moment and try again.
ja: モデルが混み合っています。少し待ってからお試しください。
zh_hans: 模型正忙。请稍候再试。

source: The narrator declined to describe that scene. Try a different action.
ja: 語り手はその場面の描写を断りました。別の行動を試してください。
zh_hans: 叙述者拒绝描述这一场景。请尝试其他行动。

source: The narrator fell silent. Try again.
ja: 語り手が沈黙しました。もう一度お試しください。
zh_hans: 叙述者陷入了沉默。请再试一次。

source: The narrator is still answering the previous turn.
ja: 語り手はまだ前のターンに応答中です。
zh_hans: 叙述者仍在回应上一回合。

source: The narrator refused this request.
ja: 語り手はこの要求を拒否しました。
zh_hans: 叙述者拒绝了这个请求。

source: The narrator's reply could not be read.
ja: 語り手の返答を読み取れませんでした。
zh_hans: 无法读取叙述者的回复。

source: The on-device model assets are not available yet.
ja: デバイス上のモデルのアセットはまだ利用できません。
zh_hans: 设备端模型资源尚不可用。

source: The on-device model does not support this language.
ja: デバイス上のモデルはこの言語に対応していません。
zh_hans: 设备端模型不支持此语言。

source: The on-device model is still downloading. Try again shortly.
ja: デバイス上のモデルをダウンロード中です。しばらくしてからお試しください。
zh_hans: 设备端模型仍在下载。请稍后再试。

source: The on-device model is unavailable.
ja: デバイス上のモデルを利用できません。
zh_hans: 设备端模型不可用。

source: The personality becomes the model's instructions, so it shapes every turn.
ja: 性格はモデルへの指示になるため、すべてのターンに影響します。
zh_hans: 性格会成为模型的指令，因此会影响每一回合。

source: The request timed out.
ja: リクエストがタイムアウトしました。
zh_hans: 请求超时。

source: The story grew past the model's memory. Older events were condensed. Try again.
ja: 物語がモデルの記憶を超えました。古い出来事を要約しました。もう一度お試しください。
zh_hans: 故事超出了模型的记忆。较早的事件已被压缩。请再试一次。

source: This device cannot run Apple Intelligence. Switch to Cloud mode.
ja: このデバイスでは Apple Intelligence を実行できません。クラウドモードに切り替えてください。
zh_hans: 此设备无法运行 Apple 智能。请切换到云端模式。

source: To
ja: 変換先
zh_hans: 到

source: Treasury
ja: 金庫
zh_hans: 金库

source: Try “spent 20 silver on bread” or “gave 5 gold to Mira”. Parsed on-device when Apple Intelligence is available.
ja: 「パンに銀貨20枚使った」「ミラに金貨5枚渡した」のように入力してみてください。Apple Intelligence が使える場合はデバイス上で解析されます。
zh_hans: 试试“花了20银币买面包”或“给了米拉5金币”。Apple 智能可用时在设备上解析。

source: Turn on Apple Intelligence in Settings, or switch to Cloud mode.
ja: 「設定」で Apple Intelligence をオンにするか、クラウドモードに切り替えてください。
zh_hans: 请在“设置”中开启 Apple 智能，或切换到云端模式。

source: Unavailable
ja: 利用不可
zh_hans: 不可用

source: Unknown currency %@.
ja: 不明な通貨 %@。
zh_hans: 未知货币 %@。

source: Use %@
ja: %@を使う
zh_hans: 使用%@

source: Version
ja: バージョン
zh_hans: 版本

source: What do you do?
ja: どうしますか？
zh_hans: 你要做什么？

source: World
ja: 世界
zh_hans: 世界

source: You
ja: あなた
zh_hans: 你

source: You have been summoned.
ja: あなたは召喚されました。
zh_hans: 你被召唤了。

source: You're offline. Switch to On-device mode to keep playing.
ja: オフラインです。デバイス上モードに切り替えてプレイを続けてください。
zh_hans: 您已离线。请切换到设备端模式以继续游玩。

source: Your hero
ja: あなたの主人公
zh_hans: 你的主角

source: keyword parser
ja: キーワード解析
zh_hans: 关键词解析

source: on-device model
ja: デバイス上のモデル
zh_hans: 设备端模型

source: ≈ %@ back home
ja: ≈ 元の世界で %@
zh_hans: ≈ 相当于老家的 %@

source: ≈ %@ in the old world
ja: ≈ 元の世界で %@
zh_hans: ≈ 相当于旧世界的 %@

source: Apple Intelligence
zh_hans: Apple 智能
